InformationRegisters/ПрогрессОбученияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПрогрессОбученияСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прогресс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияПрогрессаОбучения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РегистраторПрогресса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИндивидуальныйПланРазвития</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбучениеРазвитиеСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МероприятияОбученияРазвития</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПрогрессОбученияСотрудников/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Сотрудник",
		"УправленческиеДанные");
КонецПроцедуры

#КонецОбласти

Процедура ВнестиПрогрессОбучения(Регистратор, Сотрудник, ПрогрессМероприятий) Экспорт
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("РегистрСведений.ПрогрессОбученияСотрудников");
		Блокировка.Заблокировать();
		
		Для Каждого ПрогрессМероприятия Из ПрогрессМероприятий Цикл
			Набор = СоздатьНаборЗаписей();
			Набор.Отбор.РегистраторПрогресса.Установить(Регистратор);
			Набор.Отбор.Сотрудник.Установить(Сотрудник);
			Набор.Отбор.Мероприятие.Установить(ПрогрессМероприятия.Ключ);
			Для Каждого ЗначениеПрогресса Из ПрогрессМероприятия.Значение Цикл
				Набор.Отбор.НомерПериода.Установить(ЗначениеПрогресса.Ключ);
				Набор.Прочитать();
				Если Набор.Количество() = 0 Тогда
					Набор.Добавить();
				КонецЕсли;
				Для Каждого Запись Из Набор Цикл
					Запись.РегистраторПрогресса = Регистратор;
					Запись.Сотрудник = Сотрудник;
					Запись.Мероприятие = ПрогрессМероприятия.Ключ;
					Запись.НомерПериода = ЗначениеПрогресса.Ключ;
					Запись.Прогресс = ЗначениеПрогресса.Значение;
				КонецЦикла;
				Набор.Записать();
			КонецЦикла;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Внесение прогресса прохождения мероприятий обучения'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ОчиститьПрогрессОбучения(Регистратор, Сотрудник, Мероприятие) Экспорт
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("РегистрСведений.ПрогрессОбученияСотрудников");
		Блокировка.Заблокировать();
		
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.РегистраторПрогресса.Установить(Регистратор);
		Набор.Отбор.Сотрудник.Установить(Сотрудник);
		Набор.Отбор.Мероприятие.Установить(Мероприятие);
		Набор.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Очистка прогресса прохождения мероприятий обучения'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Функция ПрогрессОбучения(Сотрудники, Регистратор = Неопределено) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрогрессОбученияСотрудников.РегистраторПрогресса КАК РегистраторПрогресса,
		|	ПрогрессОбученияСотрудников.Сотрудник КАК Сотрудник,
		|	ПрогрессОбученияСотрудников.Мероприятие КАК Мероприятие,
		|	ПрогрессОбученияСотрудников.НомерПериода КАК НомерПериода,
		|	ПрогрессОбученияСотрудников.Прогресс КАК Прогресс
		|ИЗ
		|	РегистрСведений.ПрогрессОбученияСотрудников КАК ПрогрессОбученияСотрудников
		|ГДЕ
		|	ПрогрессОбученияСотрудников.Сотрудник В(&Сотрудники)";
	
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	
	Если Регистратор <> Неопределено Тогда
		Запрос.УстановитьПараметр("Регистратор", Регистратор);
		Запрос.Текст = Запрос.Текст + Символы.ПС + 
		"И ПрогрессОбученияСотрудников.РегистраторПрогресса = &Регистратор"
	КонецЕсли;
	
	ПрогрессОбучения = Запрос.Выполнить().Выгрузить();
	
	Возврат ПрогрессОбучения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
